{"config": [{"config": {"recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_regularizer": null, "dtype": "float32", "unit_forget_bias": true, "recurrent_dropout": 0.0, "return_state": false, "use_bias": true, "units": 256, "batch_input_shape": [null, 21, 9], "activation": "tanh", "recurrent_regularizer": null, "implementation": 1, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "trainable": true, "unroll": false, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "name": "lstm_35", "kernel_regularizer": null, "bias_constraint": null, "return_sequences": true, "kernel_constraint": null, "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "noise_shape": null, "seed": null, "rate": 0.3, "name": "dropout_35"}, "class_name": "Dropout"}, {"config": {"recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_regularizer": null, "dtype": "float32", "unit_forget_bias": true, "recurrent_dropout": 0.0, "return_state": false, "use_bias": true, "units": 256, "batch_input_shape": [null, 21, 9], "activation": "tanh", "recurrent_regularizer": null, "implementation": 1, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "trainable": true, "unroll": false, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "name": "lstm_36", "kernel_regularizer": null, "bias_constraint": null, "return_sequences": false, "kernel_constraint": null, "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "noise_shape": null, "seed": null, "rate": 0.3, "name": "dropout_36"}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "name": "dense_35", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "units": 32, "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "name": "dense_36", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "units": 1, "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}], "keras_version": "2.1.4", "class_name": "Sequential", "backend": "tensorflow"}